benchmark/results/post-redis/wrk_conns_100_multiuser_console.log
Running 30s test @ http://localhost:8000/api/v1/posts/9/
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.54ms   39.34ms 593.39ms   94.74%
    Req/Sec   636.14    163.51     1.35k    74.97%
  149753 requests in 30.08s, 91.57MB read
Requests/sec:   4978.15
Transfer/sec:      3.04MB

=== hot post benchmark (wrk) ===
pool_size: 100
requests: 149753  throughput: 4978.15 req/s  errors(non-200): 0
latency avg: 25.54ms  p50: 17.55ms  p90: 46.55ms  p95: 66.56ms  p99: 199.32ms  max: 593.39ms
socket errors: connect=0 read=0 write=0 timeout=0