benchmark/results/post-redis/wrk_conns_500_multiuser_console.log
Running 30s test @ http://localhost:8000/api/v1/posts/9/
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    83.47ms   38.92ms 474.87ms   80.10%
    Req/Sec   757.23    128.00     1.06k    73.60%
  181053 requests in 30.08s, 110.71MB read
Requests/sec:   6019.90
Transfer/sec:      3.68MB

=== hot post benchmark (wrk) ===
pool_size: 100
requests: 181053  throughput: 6019.90 req/s  errors(non-200): 0
latency avg: 83.47ms  p50: 75.51ms  p90: 134.23ms  p95: 158.38ms  p99: 215.50ms  max: 474.87ms
socket errors: connect=0 read=0 write=0 timeout=0